pincanelo-api/app/controllers/players_controller.rb

SELECT "players".* FROM "players"
---
  def index
    render json: Player.all, status: :ok

INSERT INTO "players" ("name", "elo_rating", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Pippo"], ["elo_rating", 1500], ["created_at", "2024-10-17 15:23:41.694218"], ["updated_at", "2024-10-17 15:23:41.694218"]]
---
  def create
    player = Player.create(player_params)